Repository: MaratTazhetdinov/Checkers
Catalog: Homework 12/*.lproj/Localizable.strings
Languages: ru

# newGameButton
source: New Game
ru: Новая Игра

# savedGameAlertMessage
source: Do you want to continue a previous game?
ru: Вы хотите продолжить предыдущую игру?

# continueAlert
source: Continue
ru: Продолжить

# startAlert
source: Start a New Game
ru: Начать Новую Игру

# cancelAlert
source: Cancel
ru: Отмена

# resultsButton
source: Results
ru: Результаты

# resultsLabel
source: Results
ru: Результаты

# settingsButton
source: Settings
ru: Настройки

# enterNamesLabel
source: Enter your names
ru: Введите ваши имена

# firstPlayerLabel
source: First Player
ru: Первый игрок

# secondPlayerLabel
source: Second Player
ru: Второй игрок

# enterAlert
source: You have to enter your names
ru: Вы должны ввести ваши имена

# lengthAlert
source: The name couldn't be more than 10 letters
ru: Имя не может быть больше 10 символов

# dateLabel
source: Game started at
ru: Игра началась в

# backMainMenuLabel
source: Back to Main Menu
ru: Вернуться в Главное Меню

# winAlert
source: wins!
ru: выиграл!

# backButtonAlertMessage
source: Do you want to save the game?
ru: Вы хотите сохранить игру?

# saveAlert
source: Save and quit
ru: Сохранить и выйти

# notSaveAlert
source: Don't save and quit
ru: Не сохранять и выйти

# checkersStylelabel
source: Choose checkers style
ru: Выберите стиль шашек

# changeDeskButton
source: Change Desk Screen
ru: Сменить фон

# resetButton
source: Reset Desk Screen
ru: Фон по умолчанию

# infoLabel1
source: Checkers has ancient roots. It is thought that the earliest form of checkers was a game discovered in an archeological dig at Ur in Iraq. Carbon dating makes it appear that this game was played around 3000 B.C. However, the game used a slightly different board, a different number of pieces and no one is quite certain of the exact rules.
ru: У шашек древние корни. Считается, что самой ранней версией шашек была игра, обнаруженная при археологических раскопках в Уре в Ираке. Углеродный анализ позволяет предположить, что в эту игру играли около 3000 г. до Н.Э. Однако в игре использовалась немного другая доска, другое количество фигур, и никто не знает точных правил.

# infoLabel2
source: In ancient Egypt a game called Alquerque, which had a 5X5 board was a common and much played game. Historians have traced it as far back as 1400 B.C. It was a game of such popularity that it was played all over the western world for thousands of years. Around 1100 a Frenchman got the idea of playing the game on a chess board. This meant expanding the number of pieces to 12 on a side. It was then called Fierges or Ferses. It was soon found that making jumps mandatory made the game more challenging. The French called this version Jeu Force. The older version was considered more of a social game for women and was called Le Jeu Plaisant De Dames.
ru: В Древнем Египте игра под названием Alquerque с доской 5X5 была популярной и широко распространенной игрой. Историки упомянали ее еще до 1400 года до нашей эры. Это была настолько популярная игра, что в нее на протяжении тысячелетий играли во всем западном мире. Примерно в 1100 году одному французу пришла в голову идея сыграть в шашки на шахматной доске. Это означало увеличение количества фигур на стороне до 12. Тогда он назывался «Fierges» или «Ferses». Вскоре выяснилось, что введение обязательных ходов делает игру более сложной. Французы назвали эту версию «Jeu Force». Старая версия считалась скорее социальной игрой для женщин и называлась «Le Jeu Plaisant De Dames».

# infoLabel3
source: Now the rules for checkers were set and the game was exported to England and America. In Great Britain the game was called Draughts. Books were written on the game in Spain as early as the mid 1500s and in England a mathematician name William Payne wrote his own treatise on Draughts in 1756. Through the years the game has retained its popularity. In 1847 the first world championship was awarded. Yet as time went on, it was realized that certain openings always gave one side an advantage. Thus, two move restrictions were developed for expert players that actually began the game in a random manner. Today even three move restrictions are used in tournament checkers. Checkers first hit the computer programmers' radar screens even before World War II. Although computers were in a rudimentary stage of development a famous pioneer, Alan Turing, created a basic program for checkers that required calculations be done on paper (because the computers themselves were not ready to be used in this fashion).
ru: Правила игры в шашки были установлены, и игра была экспортирована в Англию и Америку. В Великобритании игра называлась «Шашки». Книги об игре были написаны в Испании еще в середине 1500-х годов, а в Англии математик Уильям Пейн написал свой собственный трактат о шашках в 1756 году. На протяжении многих лет игра сохраняла свою популярность. В 1847 году был присужден первый чемпионат мира. Однако со временем стало ясно, что определенные открытые позиции всегда давали преимущество одной стороне. Таким образом, для опытных игроков были разработаны два ограничения на ходы, которые фактически начинали игру случайным образом. Сегодня в турнирных шашках используются даже три ограничения на ход. Шашки впервые попали на радары компьютерных программистов еще до Второй мировой войны. Хотя компьютеры находились в зачаточном состоянии, знаменитый пионер Алан Тьюринг создал базовую программу для шашек, которая требовала, чтобы вычисления выполнялись на бумаге (поскольку сами компьютеры не были готовы к использованию таким образом).

# infoLabel4
source: The first program to actually be put on a computer was created in 1952 by Arthur L. Samuel. As the years passed programs for checkers were improved primarily because of the ever increasing capacity and speed. Modern programs make use of data bases that show every possible combination of moves when 8 pieces are remaining on the board. This is thought in recent years to have been expanded to 10 pieces. This means that actual strategies needed by the program play less and less role and pure data base searches more and more. Computer programs have consistently played the best human players available to a series of draws (and even defeating them now and then). Today the game is as healthy as ever, with people all around the world playing at least a version of it. It can be good training in logic and thought and can be a lot of fun on a cold winter's evening, or in the summer shade of an oak tree at the local park.
ru: Первая программа, которую фактически можно было реализовать на компьютере, была создана в 1952 году Артуром Л. Самуэлем. Шли годы, программы для шашек совершенствовались в первую очередь из-за постоянно растущих возможностей и скоростей. Современные программы используют базы данных, которые показывают все возможные комбинации ходов, когда на доске остается 8 фигур. Считается, что в последние годы его расширили до 10 штук. Это означает, что актуальные стратегии, необходимые программе, играют все меньше и меньше роли, а поиск в чистой базе данных все больше и больше. Компьютерные программы постоянно играли с лучшими игроками-людьми и даже иногда побеждали их. Сегодня игра такая же популярная, как и прежде, и люди во всем мире играют по крайней мере в различные ее версии. Это хорошая тренировка логики и мышления, которая может быть очень веселой холодным зимним вечером или в летней тени дуба в местном парке.

# infoLabel6
source: All rights reserved.
ru: Все права защищены.

# languageLabel
source: Language
ru: Язык

# backButton
source: Back
ru: Назад

# infoHeaderLabel
source: History of Checkers
ru: История шашек
